{
  "data": [
    {
      "heading": "Introduction",
      "description": [
        "<h2>JavaScript Introduction</h2>",
        "<p>JavaScript is an high-level, object-based, interpreted programming language which is lightweight and cross-platform.</p>",
        "<p>Javascript was developed by Brendan Eich.</p>",
        "<p>Javascript is also well-known as the scripting language for Web pages. Many non-browser environments also use it, such as Node.js and Apache CouchDB. JS is a prototype-based, multi-paradigm, dynamic scripting language.</p>"
      ]
    },
    {
      "heading": "Getting started",
      "description": [
        "<h2>Getting started with JavaScript</h2>",
        "<p>Getting started with JavaScript is easy: all you need is a modern Web browser or Node.js.</p>",
        "<p>Browser provides the Web Console tool that is useful for experimenting with JavaScript</p>",
        "<h3>The Web Console</h3>",
        "<p>The Web Console shows you information about the currently loaded Web page, and also includes a command line that you can use to execute JavaScript expressions in the current page.</p>",
        "<p>To open the Web Console (Ctrl+Shift+I on Windows and Linux or Cmd-Option-K on Mac), select \"Web Console\" from the \"Developer\" menu, which is under the \"Tools\" menu in Browser.</p>",
        "<p>The Web Console is great for executing single lines of JavaScript, but although you can execute multiple lines, it's not very convenient for that, and you can't save your code samples using the Web Console.</p>"
      ]
    },
    {
      "heading": "Strings",
      "description": []
    },
    {
      "heading": "Numbers",
      "description": []
    },
    {
      "heading": "Booleans",
      "description": []
    },
    {
      "heading": "Operators",
      "description": []
    },
    {
      "heading": "Variables",
      "description": []
    },
    {
      "heading": "Functions",
      "description": []
    },
    {
      "heading": "Conditionals",
      "description": []
    },
    {
      "heading": "Arrays",
      "description": []
    },
    {
      "heading": "Objects",
      "description": []
    }
  ]
}